<%@ page language="java" pageEncoding="UTF-8"%>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <title>有才网 帮助中心</title>
    
	<meta http-equiv="pragma" content="no-cache">
	<meta http-equiv="cache-control" content="no-cache">
	<meta http-equiv="expires" content="0">    
	<meta http-equiv="keywords" content="keyword1,keyword2,keyword3">
	<meta http-equiv="description" content="This is my page">
	<!--
	<link rel="stylesheet" type="text/css" href="styles.css">
	-->

  </head>
  
  <body bgcolor="#FFF8DC">
    <br><hr width="71%">
    <div style="font-size:16;margin-left:170px;margin-right:170px;background:#FFF8BB;">
    从享受生活的角度上来说：“程序员并不是一种最好的职业，我认为两种人可以做程序员，第一，你不做程序员，你就没有什么工作可做，或者说是即使有可以做的工作但是你非常不愿意去做；第二，你非常痴迷和爱好程序，并且在这方面有一些天赋和优势。程序员的结局也是有两种：第一，默默退休，第二以程序员为起点或跳板，注意积累，跟对了好的老板或团队，找到和很好的搭档自己创业，成为IT金领和富翁。”<br><br>
人们在时间面前是平等的，吾生也有涯，所以，你的经验更丰富点，那不算什么，经验是用时间积累的，你一生只有那么多时间，你能积累多少经验呢？最重要的是你的学习能力和学习方法，这个发挥的能量可以有很大差异，要提高学习能力和学习方法首先要学会思考和总结，要学会掌握事物的根本性的东西，而不是一些表面的细节。学习方法和学习能力对于IT工作者来说尤为重要，因为IT行业技术更新太快，并且细节太多，同一个技术的细节变来变去也是常有的事情，所以，IT技术学习者绝不能照着书籍和老师的讲解死记硬背和生搬硬套。搞IT工作很累人，如果学习方法不对、学习能力不强，那就更累了，不过，这怨不得别人，你的学习方法和学习能力只适合做刷盘子的工作，却非要跑到程序员圈子里来混，那谁能有办法拯救你！<br><br>
在没有人指引的情况下，只能是自己一个知识点、一个知识点地漫无目的学习，等到积累了足够的知识量后，才有能力开始思考和琢磨原理方面的问题，这个学习过程很漫长。如果能在好老师的指引下，老师会启发你先思考原理问题，然后再去学习一个具体的知识点，让你能够举一反三、触类旁通，这样的学习效率就会更高。<br><br>
多学了几个知识，并不能说明你就很厉害了，只能说是你比别人投入了更多的时间和精力而已，别人想做也能做到！不是你学了多少知识就算厉害了，关键是要用好学到的知识，要让学到的知识发挥出最大的社会价值和经济价值，这才是最厉害的。<br><br>
另外，一个人的未来和造化，会深受环境的影响，所谓孟母三迁，近朱者赤、近墨者黑的大大道理，这些典故大家不一定能深刻领悟和感受，我们就不多说了。就拿现代比较接近我们生活的事例来说，如果你周围的朋友全是以擦皮鞋为生、每月辛辛苦苦下来就挣1500元，那么估计你的职业也是跟着擦皮鞋了，即使你再聪明和再勤奋，顶多每月比你那帮朋友多挣300元，合下来也就区区1800元/月。前几年只要抓住了大势，没钱全部找银行贷款了在北京买房、到山西开煤矿，是头XX也能每年大把大把地捞钱，如果你周围的朋友全是投机倒把的买房和开煤矿者，你的职业自然也是与他们干同样的事情，即使你再差，每年也能挣到百来万不成问题，这就是环境的重要性。聪明的你因为没有机会置身于炒房团中，比那些有机会接触炒房者的XX挣得就要少、就要累。<br><br>
    </div>
  </body>
</html>
